Revit 2027 API
BuiltInFailures.DesignOptionFailures.ConfusingHostByElementsInMainModel Property
 An insert in a design option cannot be hosted by an element in the Main Model [--if you continue it will not be added to the design option set].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ConfusingHostByElementsInMainModel { get; }
Public Shared ReadOnly Property ConfusingHostByElementsInMainModel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ConfusingHostByElementsInMainModel {
	FailureDefinitionId^ get ();
}
static member ConfusingHostByElementsInMainModel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace